
########################################################################################################################
# REPLICATION
########################################################################################################################

CREATE USER 'docker_replication_user'@'172.16.0.0/255.240.0.0' IDENTIFIED BY 'docker_replication_password';
GRANT REPLICATION SLAVE ON *.* TO 'docker_replication_user'@'172.16.0.0/255.240.0.0';
FLUSH PRIVILEGES;

########################################################################################################################
# PROMETHEUS EXPORTER
########################################################################################################################

# https://hub.docker.com/r/prom/mysqld-exporter/
# https://grafana.com/oss/prometheus/exporters/mysql-exporter/?tab=installation
# Примечание: рекомендуется установить максимальный лимит подключений для пользователя-экспортера,
# чтобы избежать перегрузки сервера мониторинговыми скрапами при большой нагрузке.
CREATE USER 'docker_prometheus_exporter_user'@'172.16.0.0/255.240.0.0'
    IDENTIFIED BY 'docker_prometheus_exporter_password'
    WITH MAX_USER_CONNECTIONS 3;
GRANT PROCESS, REPLICATION CLIENT, SELECT ON *.* TO 'docker_prometheus_exporter_user'@'172.16.0.0/255.240.0.0';
FLUSH PRIVILEGES;

########################################################################################################################
# KAFKA-CONNECT
########################################################################################################################

# https://debezium.io/documentation/reference/3.5/connectors/mysql.html#mysql-creating-user
# Kafka-Connect может применяться для различных целей, поэтому ограничений на конкретные схемы и таблицы нет.
CREATE USER 'docker_kafka_connect_user'@'172.16.0.0/255.240.0.0' IDENTIFIED BY 'docker_kafka_connect_password';
GRANT SELECT, RELOAD, SHOW DATABASES, REPLICATION SLAVE, REPLICATION CLIENT
    ON *.* TO 'docker_kafka_connect_user'@'172.16.0.0/255.240.0.0';
FLUSH PRIVILEGES;

########################################################################################################################
# HEALTHCHECK
########################################################################################################################

# localhost -- только из того же контейнера (см. Dockerfile HEALTHCHECK).
CREATE USER 'docker_healthcheck_user'@'localhost' IDENTIFIED BY '';

########################################################################################################################
# APP
########################################################################################################################

CREATE USER 'docker_app_user'@'172.16.0.0/255.240.0.0' IDENTIFIED BY 'docker_app_password';

########################################################################################################################
# MIGRATION
########################################################################################################################

CREATE USER 'docker_migration_user'@'172.16.0.0/255.240.0.0' IDENTIFIED BY 'docker_migration_password';

########################################################################################################################
# DB AUTH
########################################################################################################################

CREATE DATABASE auth;
USE auth;

# Теоретически, может понадобиться еще и TRUNCATE, но он предоставляется только вместе с DROP-привилегией,
# поэтому, если такое разрешение и понадобится, то лучше его предоставлять для отдельных таблиц.
# CREATE TEMPORARY TABLES -- т.к. применение достаточно редкое, пусть тоже будет запрещено по умолчанию.
GRANT SELECT, INSERT, UPDATE, DELETE ON auth.* TO 'docker_app_user'@'172.16.0.0/255.240.0.0';

GRANT ALL ON auth.* TO 'docker_migration_user'@'172.16.0.0/255.240.0.0';

FLUSH PRIVILEGES;

########################################################################################################################
# DB CONFIRMATION
########################################################################################################################

CREATE DATABASE confirmation;
USE confirmation;

# Теоретически, может понадобиться еще и TRUNCATE, но он предоставляется только вместе с DROP-привилегией,
# поэтому, если такое разрешение и понадобится, то лучше его предоставлять для отдельных таблиц.
# CREATE TEMPORARY TABLES -- т.к. применение достаточно редкое, пусть тоже будет запрещено по умолчанию.
GRANT SELECT, INSERT, UPDATE, DELETE ON confirmation.* TO 'docker_app_user'@'172.16.0.0/255.240.0.0';

GRANT ALL ON confirmation.* TO 'docker_migration_user'@'172.16.0.0/255.240.0.0';

FLUSH PRIVILEGES;

########################################################################################################################
# DB GATEWAY
########################################################################################################################

CREATE DATABASE gateway;
USE gateway;

# Теоретически, может понадобиться еще и TRUNCATE, но он предоставляется только вместе с DROP-привилегией,
# поэтому, если такое разрешение и понадобится, то лучше его предоставлять для отдельных таблиц.
# CREATE TEMPORARY TABLES -- т.к. применение достаточно редкое, пусть тоже будет запрещено по умолчанию.
GRANT SELECT, INSERT, UPDATE, DELETE ON gateway.* TO 'docker_app_user'@'172.16.0.0/255.240.0.0';

GRANT ALL ON gateway.* TO 'docker_migration_user'@'172.16.0.0/255.240.0.0';

FLUSH PRIVILEGES;

########################################################################################################################
