package http

import (
	"context"
	assert "github.com/selyukovn/go-wm-assert"
	"net"
	"net/http"
)

// ---------------------------------------------------------------------------------------------------------------------
// Struct
// ---------------------------------------------------------------------------------------------------------------------

type Server struct {
	s *http.Server
}

// ---------------------------------------------------------------------------------------------------------------------
// Create
// ---------------------------------------------------------------------------------------------------------------------

func NewServer(handler http.Handler) Server {
	assert.NotNilDeepMust(handler)

	s := &http.Server{
		Addr:    ":80",
		Handler: handler,
	}

	return Server{
		s: s,
	}
}

// ---------------------------------------------------------------------------------------------------------------------
// Actions
// ---------------------------------------------------------------------------------------------------------------------

func (s Server) Start(ctx context.Context) error {
	s.s.BaseContext = func(net.Listener) context.Context { return ctx }
	return s.s.ListenAndServe()
}

func (s Server) Stop(ctx context.Context) error {
	// todo : возможно, есть смысл ограничить по времени
	return s.s.Shutdown(ctx)
}

// ---------------------------------------------------------------------------------------------------------------------
