package sch

import (
	"context"
	"github.com/robfig/cron/v3"
	assert "github.com/selyukovn/go-wm-assert"
	"sync"
)

// ---------------------------------------------------------------------------------------------------------------------
// Struct
// ---------------------------------------------------------------------------------------------------------------------

type Scheduler struct {
	c  *cron.Cron
	wg *sync.WaitGroup
}

// ---------------------------------------------------------------------------------------------------------------------
// Create
// ---------------------------------------------------------------------------------------------------------------------

func NewScheduler(c *cron.Cron) Scheduler {
	assert.NotNilDeepMust(c)

	return Scheduler{
		c:  c,
		wg: new(sync.WaitGroup),
	}
}

// ---------------------------------------------------------------------------------------------------------------------
// Actions
// ---------------------------------------------------------------------------------------------------------------------

func (s Scheduler) Start(ctx context.Context) error {
	// todo : использовать контекст как базовый
	s.c.Start()
	s.wg.Add(1)
	s.wg.Wait()
	return nil
}

func (s Scheduler) Stop(ctx context.Context) error {
	// todo : возможно, есть смысл ограничить по времени
	s.wg.Done()
	<-s.c.Stop().Done()
	return nil
}

// ---------------------------------------------------------------------------------------------------------------------
