package cfm

import (
	"fmt"
	assert "github.com/selyukovn/go-wm-assert"
)

// ---------------------------------------------------------------------------------------------------------------------
// Struct
// ---------------------------------------------------------------------------------------------------------------------

type ErrorNoAttemptsLeft struct {
	cfmId Id
}

// ---------------------------------------------------------------------------------------------------------------------
// Create
// ---------------------------------------------------------------------------------------------------------------------

// NewErrNoAttemptsLeft
//
// Паникует при нулевых аргументах.
func NewErrNoAttemptsLeft(cfmId Id) ErrorNoAttemptsLeft {
	assert.FalseMust(cfmId.IsNil())

	return ErrorNoAttemptsLeft{cfmId: cfmId}
}

// ---------------------------------------------------------------------------------------------------------------------
// State
// ---------------------------------------------------------------------------------------------------------------------

func (e ErrorNoAttemptsLeft) Error() string {
	return fmt.Sprintf("конфирмация %q незапрашиваемая", e.cfmId)
}

func (e ErrorNoAttemptsLeft) CfmId() Id {
	return e.cfmId
}

// ---------------------------------------------------------------------------------------------------------------------
