#!/bin/sh
set -e

config_file=$1

# ----------------------------------------------------------------------------------------------------------------------
# Дополнительная настройка
# ----------------------------------------------------------------------------------------------------------------------

# Чтобы права пользователей не терялись при каждом перезапуске контейнера, необходимо вынести их в acl-файл, в volume.
# Т.е. файл может быть создан только при запуске контейнера (ибо volume)
# и должен быть создан до запуска redis-server (сервер не запустится без файла).

# см. redis.conf
acl_file="/data/acl"

if [ ! -f "${acl_file}" ]; then
  echo 'user default on nopass ~* &* +@all' > ${acl_file}
fi

# ----------------------------------------------------------------------------------------------------------------------
# Инициализация
# ----------------------------------------------------------------------------------------------------------------------

init_file="/data/init"

# Инициализация выполняется отложено и в отдельном процессе,
# поскольку для ее начала нужен healthy-статус контейнера.
(
  echo "[$(date +"%Y-%m-%d %H:%M:%S")] INFO [ИНИЦИАЛИЗАЦИЯ] Старт..."
  if [ -f "${init_file}" ]; then
    echo "[$(date +"%Y-%m-%d %H:%M:%S")] INFO [ИНИЦИАЛИЗАЦИЯ] Уже выполнена!"
  else
    # 120 взято навскидку -- в нормальной ситуации более, чем достаточно.
    for i in $(seq 1 120); do
      echo "[$(date +"%Y-%m-%d %H:%M:%S")] INFO [ИНИЦИАЛИЗАЦИЯ] Healthcheck... ${i}"
      # shellcheck disable=SC2091
      # shellcheck disable=SC3046
      if ! $(source ./healthcheck.sh); then
        sleep 1
        continue
      fi

      # shellcheck disable=SC3046
      source ./init.sh

      # shellcheck disable=SC2005
      echo "$(date +"%Y-%m-%d %H:%M:%S")" > ${init_file}

      echo "[$(date +"%Y-%m-%d %H:%M:%S")] INFO [ИНИЦИАЛИЗАЦИЯ] Готово!"

      break # !!!
    done

    if [ ! -f "${init_file}" ]; then
      echo "[$(date +"%Y-%m-%d %H:%M:%S")] ERROR [ИНИЦИАЛИЗАЦИЯ] НЕ ВЫПОЛНЕНА!!!"
      exit 1
    fi
  fi
) &

# ----------------------------------------------------------------------------------------------------------------------
# Запуск
# ----------------------------------------------------------------------------------------------------------------------

# exec обязателен для использования того же PID=1 для корректной обработки сигналов.
#
# "... Note that in order to read the configuration file, Redis must be
# started with the file path as first argument: ./redis-server /path/to/redis.conf ..."
exec /usr/local/bin/docker-entrypoint.sh "${config_file}"

# ----------------------------------------------------------------------------------------------------------------------
