package client

import (
	"fmt"
	"github.com/selyukovn/go-std"
	assert "github.com/selyukovn/go-wm-assert"
	"regexp"
)

// ---------------------------------------------------------------------------------------------------------------------
// Const
// ---------------------------------------------------------------------------------------------------------------------

var UserAgentNil = UserAgent{}

// ---------------------------------------------------------------------------------------------------------------------
// Struct
// ---------------------------------------------------------------------------------------------------------------------

type UserAgent struct {
	value string
}

// ---------------------------------------------------------------------------------------------------------------------
// Create
// ---------------------------------------------------------------------------------------------------------------------

// Поскольку строгих форматов нет, проверки самые базовые на основе популярных значений и минимального смысла:
//   - первая буква
//   - общий набор допустимых символов
//   - длина [2,255]
//   - сколь-нибудь логичное окончание
var userAgentRegexCompiled = regexp.MustCompile(`^[a-zA-Z][a-zA-Z0-9\s./\-_();:,]{0,253}[a-zA-Z0-9.)]$`)

// UserAgentFromString
//
//   - std.ErrorValidation
func UserAgentFromString(s string) (UserAgent, error) {
	err := assert.Str().
		NotEmpty("User-Agent не может быть пустым").
		Regexp(userAgentRegexCompiled, fmt.Sprintf("User-Agent %q некорректен", s)).
		Check(s)
	if err != nil {
		return UserAgentNil, std.NewErrorValidationFf(err.Error())
	}

	return UserAgent{value: s}, nil
}

// ---------------------------------------------------------------------------------------------------------------------
// State
// ---------------------------------------------------------------------------------------------------------------------

func (ua UserAgent) IsNil() bool {
	return ua == UserAgentNil
}

func (ua UserAgent) String() string {
	return ua.value
}

// ---------------------------------------------------------------------------------------------------------------------
