package cfm

import (
	"fmt"
	"github.com/selyukovn/go-std"
	assert "github.com/selyukovn/go-wm-assert"
	"regexp"
)

// ---------------------------------------------------------------------------------------------------------------------
// Const
// ---------------------------------------------------------------------------------------------------------------------

var CodeNil = Code{value: ""}

// ---------------------------------------------------------------------------------------------------------------------
// Struct
// ---------------------------------------------------------------------------------------------------------------------

type Code struct {
	value string
}

// ---------------------------------------------------------------------------------------------------------------------
// Create
// ---------------------------------------------------------------------------------------------------------------------

var codeRegexpCompiled = regexp.MustCompile("(^\\d{6}$)")

// CodeFromString
//
//   - std.ErrorValidation
func CodeFromString(value string) (Code, error) {
	err := assert.Str().
		Regexp(codeRegexpCompiled, fmt.Sprintf(
			"значение %q не соответствует регулярному выражению %q",
			value,
			codeRegexpCompiled.String(),
		)).
		Check(value)

	if err != nil {
		return CodeNil, std.NewErrorValidationFf(err.Error())
	}

	return Code{value: value}, nil
}

// ---------------------------------------------------------------------------------------------------------------------
// State
// ---------------------------------------------------------------------------------------------------------------------

func (c Code) IsNil() bool {
	return c == CodeNil
}

func (c Code) String() string {
	return c.value
}

// ---------------------------------------------------------------------------------------------------------------------
