package code

import (
	"fmt"
	"github.com/selyukovn/go-std"
	assert "github.com/selyukovn/go-wm-assert"
	"regexp"
)

// ---------------------------------------------------------------------------------------------------------------------
// Const
// ---------------------------------------------------------------------------------------------------------------------

var HashNil = Hash{value: ""}

// ---------------------------------------------------------------------------------------------------------------------
// Struct
// ---------------------------------------------------------------------------------------------------------------------

type Hash struct {
	value string
}

// ---------------------------------------------------------------------------------------------------------------------
// Create
// ---------------------------------------------------------------------------------------------------------------------

// Поскольку вид хеша зависит от реализации хешера, логичными будут только технические ограничения.
var hashRegexpCompiled = regexp.MustCompile("(^[^\\s]{1,255}$)")

// HashFromString
//
//   - std.ErrorValidation
func HashFromString(value string) (Hash, error) {
	err := assert.Str().
		Regexp(hashRegexpCompiled, fmt.Sprintf(
			"значение %q не соответствует регулярному выражению %q",
			value,
			hashRegexpCompiled.String(),
		)).
		Check(value)

	if err != nil {
		return HashNil, std.NewErrorValidationFf(err.Error())
	}

	return Hash{value: value}, nil
}

// ---------------------------------------------------------------------------------------------------------------------
// State
// ---------------------------------------------------------------------------------------------------------------------

func (h Hash) IsNil() bool {
	return h == HashNil
}

func (h Hash) String() string {
	return h.value
}

// ---------------------------------------------------------------------------------------------------------------------
