#!/bin/sh
set -e

# ----------------------------------------------------------------------------------------------------------------------
# Инициализация
# ----------------------------------------------------------------------------------------------------------------------

# Внимание!
# Скрипты инициализации аналогичны `init.sql` в `mysql`.
# По той же аналогии имеет смысл "архивировать" накопившийся набор выполненных миграций в виде "снимка".

# Инициализация выполняется отложено и в отдельном процессе,
# поскольку для ее начала нужен healthy-статус контейнера (запущен REST-сервер и т.д.).
(
  echo "[$(date +"%Y-%m-%d %H:%M:%S,%3N")] INFO [ИНИЦИАЛИЗАЦИЯ] Старт..."
  if [ -f "/var/lib/kafka/data/init" ]; then
    echo "[$(date +"%Y-%m-%d %H:%M:%S,%3N")] INFO [ИНИЦИАЛИЗАЦИЯ] Уже выполнена!"
  else
    # 120 взято навскидку -- в нормальной ситуации более, чем достаточно.
    for i in $(seq 1 120); do
      echo "[$(date +"%Y-%m-%d %H:%M:%S,%3N")] INFO [ИНИЦИАЛИЗАЦИЯ] Healthcheck... ${i}"
      # shellcheck disable=SC2091
      if ! /etc/confluent/docker/healthcheck.sh > /dev/null; then
        sleep 1
        continue
      fi

      # Да, в `confluentinc/cp-kafka-connect:8.2.0` встроен `python 3.9.25`.
      for script in *.py; do
        echo "[$(date +"%Y-%m-%d %H:%M:%S,%3N")] INFO [ИНИЦИАЛИЗАЦИЯ] ${script}..."
        python "${script}"
        echo "$(date +"%Y-%m-%d %H:%M:%S,%3N") - ${script}" >> /var/lib/kafka/data/init_scripts
      done

      echo "$(date +"%Y-%m-%d %H:%M:%S,%3N")" > /var/lib/kafka/data/init

      echo "[$(date +"%Y-%m-%d %H:%M:%S,%3N")] INFO [ИНИЦИАЛИЗАЦИЯ] Готово!"

      break # !!!
    done

    if [ ! -f "/var/lib/kafka/data/init" ]; then
      echo "[$(date +"%Y-%m-%d %H:%M:%S,%3N")] ERROR [ИНИЦИАЛИЗАЦИЯ] НЕ ВЫПОЛНЕНА!!!"
      exit 1
    fi
  fi
) &

# ----------------------------------------------------------------------------------------------------------------------
# Запуск
# ----------------------------------------------------------------------------------------------------------------------

# exec обязателен для использования того же PID=1 для корректной обработки сигналов.
exec /etc/confluent/docker/run

# ----------------------------------------------------------------------------------------------------------------------
