package account

import (
	"github.com/selyukovn/go-events"
	assert "github.com/selyukovn/go-wm-assert"
	"time"
)

// ---------------------------------------------------------------------------------------------------------------------
// Struct
// ---------------------------------------------------------------------------------------------------------------------

type EventDeactivated struct {
	event.Event
	accId Id
}

// ---------------------------------------------------------------------------------------------------------------------
// Create
// ---------------------------------------------------------------------------------------------------------------------

// NewEventDeactivated
//
// Паникует при нулевых аргументах.
func NewEventDeactivated(occurredAt time.Time, accId Id) EventDeactivated {
	assert.Time().NotZero().Must(occurredAt)
	assert.Cmp[Id]().NotEq(IdNil).Must(accId)

	return EventDeactivated{
		Event: event.NewEvent(occurredAt),
		accId: accId,
	}
}

// ---------------------------------------------------------------------------------------------------------------------
// State
// ---------------------------------------------------------------------------------------------------------------------

func (e EventDeactivated) AccId() Id {
	return e.accId
}

// ---------------------------------------------------------------------------------------------------------------------
