package http

import (
	"context"
	"example/admin/gateway/cmd/http/container"
	assert "github.com/selyukovn/go-wm-assert"
	"net/http"
)

// ---------------------------------------------------------------------------------------------------------------------
// Struct
// ---------------------------------------------------------------------------------------------------------------------

type Server struct {
	s *http.Server
}

// ---------------------------------------------------------------------------------------------------------------------
// Create
// ---------------------------------------------------------------------------------------------------------------------

// NewServer
//
// Паникует при нулевых аргументах.
func NewServer(ctr *container.Container) Server {
	assert.NotNilDeepMust(ctr)

	mux := http.NewServeMux()

	// --

	registerRoutes(mux, ctr)

	// --

	s := &http.Server{
		Addr:    ":80",
		Handler: mux,
	}

	return Server{
		s: s,
	}
}

// ---------------------------------------------------------------------------------------------------------------------
// Actions
// ---------------------------------------------------------------------------------------------------------------------

func (s Server) Start() error {
	return s.s.ListenAndServe()
}

func (s Server) Stop() error {
	// todo : возможно, есть смысл ограничить по времени
	return s.s.Shutdown(context.Background())
}

// ---------------------------------------------------------------------------------------------------------------------
