package check_session

import (
	"example/admin/auth/internal/domain/account"
	assert "github.com/selyukovn/go-wm-assert"
	"time"
)

// ---------------------------------------------------------------------------------------------------------------------
// Const
// ---------------------------------------------------------------------------------------------------------------------

var ResultNil = Result{}

// ---------------------------------------------------------------------------------------------------------------------
// Struct
// ---------------------------------------------------------------------------------------------------------------------

type Result struct {
	accId     account.Id
	sessExpAt time.Time
}

// ---------------------------------------------------------------------------------------------------------------------
// Create
// ---------------------------------------------------------------------------------------------------------------------

// resultSuccess
//
// Паникует при нулевых аргументах.
func resultSuccess(accId account.Id, sessExpAt time.Time) (Result, error) {
	assert.FalseMust(accId.IsNil())
	assert.Time().NotZero().Must(sessExpAt)

	return Result{
		accId:     accId,
		sessExpAt: sessExpAt,
	}, nil
}

// resultError
//
// Паникует при нулевых аргументах.
func resultError(err error) (Result, error) {
	assert.NotNilDeepMust(err)

	return ResultNil, err
}

// ---------------------------------------------------------------------------------------------------------------------
// State
// ---------------------------------------------------------------------------------------------------------------------

func (r Result) AccId() account.Id {
	return r.accId
}

func (r Result) SessExpAt() time.Time {
	return r.sessExpAt
}

// ---------------------------------------------------------------------------------------------------------------------
