package interceptors

import (
	"context"
	"example/admin/cfm/cmd/common/container"
	"github.com/google/uuid"
	"github.com/selyukovn/go-std/logger"
	"runtime/debug"
	"strings"
)

// NewBoundary
//
// Данный перехватчик должен быть самым внешним!
func NewBoundary() func(func(context.Context), string, *container.Container) func(context.Context) {
	// Все описанные в данном перехватчике действия слишком связаны между собой,
	// чтобы выделить каждое в отдельный перехватчик.
	return func(next func(context.Context), name string, ctr *container.Container) func(context.Context) {
		return func(ctx context.Context) {
			// ---------------------------------------------------------------------------------------------------------
			// Резервный перехватчик паники
			// ---------------------------------------------------------------------------------------------------------

			// Теоретически паника может возникнуть до основного перехватчика (например, при обогащении контекста),
			// поэтому обязательно нужен резервный перехватчик, чтобы не завалить весь сервер.

			defer func() {
				if pv := recover(); pv != nil {
					logger.PanicFf(ctx, pv, debug.Stack(), "shc.interceptors.NewBoundary")
				}
			}()

			// ---------------------------------------------------------------------------------------------------------
			// Обогащение контекста
			// ---------------------------------------------------------------------------------------------------------

			// Trace Id
			// ------------

			// Scheduler'у неоткуда брать traceId, поэтому генерим прямо тут.
			traceUuid, err := uuid.NewRandom()
			if err != nil {
				panic(err)
			}
			traceId := traceUuid.String()
			traceId = strings.Replace(traceId, "-", "", -1)

			ctx = logger.AddAttrToCtx(ctx, "trace_id", traceId)

			// ---------------------------------------------------------------------------------------------------------
			// Логирование
			// ---------------------------------------------------------------------------------------------------------

			logger.InfoFf(ctx, "%s - запуск...", name)
			defer logger.InfoFf(ctx, "%s - готово!", name)

			// ---------------------------------------------------------------------------------------------------------
			// Основной перехватчик паники
			// ---------------------------------------------------------------------------------------------------------

			// Grpc-сервер, в отличие от net/http-сервера, не умеет сам перехватывать панику.
			// Если панику не перехватить, все приложение рухнет, т.к. будет достигнута вершина стека горутины обработчика.
			// Поскольку не все обработчики могут быть сломаны, имеет смысл панику перехватывать, чтоб не валить весь сервер.

			defer func() {
				if pv := recover(); pv != nil {
					logger.PanicFf(ctx, pv, debug.Stack(), "grpc.interceptors.NewBoundary")
				}
			}()

			// ---------------------------------------------------------------------------------------------------------

			next(ctx)
		}
	}
}
